<a href="https://colab.research.google.com/github/Sorin9202/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%AC%EB%8D%94%EC%8A%A4_%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D_%EA%B8%B0%EC%B4%88_%EC%8B%A4%EC%8A%B5_7_~_14_(2020_08_03).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 7) 행, 열 생성 및 수정하기 (row, column create, update)

In [1]:
import pandas as pd

In [3]:
friend_dict_list = [
                    {'name':'Ethan', 'age':15, 'job': 'student'},
                    {'name':'Kayla', 'age':30, 'job': 'developer'},
                    {'name':'Cody', 'age':30, 'job': 'teacher'}
]
df = pd.DataFrame(friend_dict_list, columns=['name','age','job'])

In [4]:
df.head()

    name  age        job
0  Ethan   15    student
1  Kayla   30  developer
2   Cody   30    teacher

In [5]:
df['salary'] = 0

In [6]:
df.head()

    name  age        job  salary
0  Ethan   15    student       0
1  Kayla   30  developer       0
2   Cody   30    teacher       0

In [7]:
import numpy as np

In [8]:
df['salary'] = np.where(df['job'] != 'student','yes', 'no') #조건에 따라

In [9]:
df.head()

    name  age        job salary
0  Ethan   15    student     no
1  Kayla   30  developer    yes
2   Cody   30    teacher    yes

In [10]:
friend_dict_list = [
                    {'name':'Ethan', 'midterm':95, 'final':85},
                    {'name':'Mia', 'midterm':85, 'final': 80},
                    {'name':'Logan', 'midterm':30, 'final':10}
]
df = pd.DataFrame(friend_dict_list, columns=['name','midterm','final'])

In [11]:
df.head()

    name  midterm  final
0  Ethan       95     85
1    Mia       85     80
2  Logan       30     10

In [15]:
df['total'] = df['midterm'] + df['final']

In [16]:
df.head()

    name  midterm  final  totla  total
0  Ethan       95     85    180    180
1    Mia       85     80    165    165
2  Logan       30     10     40     40

In [17]:
df = df.drop('totla',axis=1) #잘못된 행 삭제

In [18]:
df.head()

    name  midterm  final  total
0  Ethan       95     85    180
1    Mia       85     80    165
2  Logan       30     10     40

In [19]:
df['average'] = df['total'] / 2

In [20]:
df.head()

    name  midterm  final  total  average
0  Ethan       95     85    180     90.0
1    Mia       85     80    165     82.5
2  Logan       30     10     40     20.0

In [32]:
#성적 확인
grades = []

for row in df['average']: #average 열에 있는 row들 다 가져오기
  if row >= 90:
    grades.append('A')
  elif row >= 80:
    grades.append('B')
  else:
    grades.append('F')

df['grade'] = grades

In [33]:
df.head()

    name  midterm  final  total  average grade
0  Ethan       95     85    180     90.0     A
1    Mia       85     80    165     82.5     B
2  Logan       30     10     40     20.0     F

In [34]:
#P/F로 표현(pandas의 apply 사용) 

def pass_or_fail(row):
  if row != 'F':
    return "Pass"
  else:
    return "Fail"

In [35]:
df.grade = df.grade.apply(pass_or_fail) #df.grade를 불러와서 pass_or_fail이라는 함수 적용시킨 값을 결과값으로

In [36]:
df.head()

    name  midterm  final  total  average grade
0  Ethan       95     85    180     90.0  Pass
1    Mia       85     80    165     82.5  Pass
2  Logan       30     10     40     20.0  Fail

In [38]:
date_list = [
             {
                 'yyyy-mm-dd':'2000-06-27'
             },
             {
                 'yyyy-mm-dd':'2007-10-27'
             }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [39]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [40]:
#연도만 따로 빼고 싶을 때(apply 이용)
def extract_year(row):
  return row.split('-')[0] #'-'을 기준으로 split한 row의 첫 번째(인덱스는 0) 값

In [41]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [42]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [48]:
friend_dict_list = [
                    {'name':'Ethan', 'midterm':95, 'final':85},
                    {'name':'Mia', 'midterm':85, 'final': 80},
                    {'name':'Logan', 'midterm':30, 'final':10}
]
df = pd.DataFrame(friend_dict_list, columns=['name','midterm','final'])

In [49]:
df.head()

    name  midterm  final
0  Ethan       95     85
1    Mia       85     80
2  Logan       30     10

In [50]:
#새로운 인물 추가

df2 = pd.DataFrame([
        ['Carter',50,50]           
],columns=['name','midterm','final'])

In [51]:
df2.head()

     name  midterm  final
0  Carter       50     50

In [52]:
df.append(df2, ignore_index= True) #인덱스(Carter의 인덱스 0은 무시하라)

     name  midterm  final
0   Ethan       95     85
1     Mia       85     80
2   Logan       30     10
3  Carter       50     50

## 8) 데이터 그룹 만들기 (Group By)

In [53]:
import pandas as pd

In [54]:
student_list = [
                {'name':'Jacob', 'major': "Computer Science",'sex': "male"},
                {'name':'Noah', 'major': "Computer Science",'sex': "male"},
                {'name':'Tyler', 'major': "Physics", 'sex': "male"},
                {'name':'Isaiah', 'major': "Psychology", 'sex': "male"},
                {'name':'Hannah', 'major': "Economics", 'sex': "female"},
                {'name':'Alexis', 'major': "Economics", 'sex': "female"},
                {'name':'Taylor', 'major': "Computer Science", 'sex': "female"},
                {'name':'Nicholas', 'major': "Computer Science", 'sex': "male"},
                {'name':'Julia', 'major': "Psychology", 'sex': "female"},
                {'name':'Emily', 'major': "Economics", 'sex': "female"},
                {'name':'Olivia', 'major': "Psychology", 'sex': "female"}

]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])

In [55]:
df

        name             major     sex
0      Jacob  Computer Science    male
1       Noah  Computer Science    male
2      Tyler           Physics    male
3     Isaiah        Psychology    male
4     Hannah         Economics  female
5     Alexis         Economics  female
6     Taylor  Computer Science  female
7   Nicholas  Computer Science    male
8      Julia        Psychology  female
9      Emily         Economics  female
10    Olivia        Psychology  female

In [56]:
#각 학과별로 몇명 있는지?

groupby_major = df.groupby('major')

In [57]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [59]:
# 더 나은 시각화를 위해 정리

for name, group in groupby_major:
  print(name + " : "+str(len(group)))
  print(group)
  print()

Computer Science : 4
       name             major     sex
0     Jacob  Computer Science    male
1      Noah  Computer Science    male
6    Taylor  Computer Science  female
7  Nicholas  Computer Science    male

Economics : 3
     name      major     sex
4  Hannah  Economics  female
5  Alexis  Economics  female
9   Emily  Economics  female

Physics : 1
    name    major   sex
2  Tyler  Physics  male

Psychology : 3
      name       major     sex
3   Isaiah  Psychology    male
8    Julia  Psychology  female
10  Olivia  Psychology  female

In [61]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()}).reset_index() #groupby_major에서 size 불러오기
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [62]:
 #column으로 들어가기 위해선 reset_index

In [63]:
#성별로
groupby_sex = df.groupby('sex')

In [64]:
for name, group in groupby_sex:
  print(name + ":"+str(len(group)))
  print(group)
  print()

female:6
      name             major     sex
4   Hannah         Economics  female
5   Alexis         Economics  female
6   Taylor  Computer Science  female
8    Julia        Psychology  female
9    Emily         Economics  female
10  Olivia        Psychology  female

male:5
       name             major   sex
0     Jacob  Computer Science  male
1      Noah  Computer Science  male
2     Tyler           Physics  male
3    Isaiah        Psychology  male
7  Nicholas  Computer Science  male

## 9) 중복 데이터 삭제하기 (drop duplicates)

In [67]:
student_list = [{'name' : 'Austin',
                 'major' : "Computer Science",
                 'sex': "male"},
                {'name' : 'Joshua',
                 'major' : "Computer Science",
                 'sex': "male"},
                {'name' : 'Zachary',
                 'major' : "Computer Science",
                 'sex': "male"},
                {'name' : 'Nicole',
                 'major' : "Psychology",
                 'sex': "female"},
                {'name' : 'Austin',
                 'major' : "Computer Science",
                 'sex': "male"}
]

df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

      name             major     sex
0   Austin  Computer Science    male
1   Joshua  Computer Science    male
2  Zachary  Computer Science    male
3   Nicole        Psychology  female
4   Austin  Computer Science    male

In [68]:
df.duplicated() #True는 중복이라는 뜻

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [69]:
#중복된 값 제거
df.drop_duplicates()

      name             major     sex
0   Austin  Computer Science    male
1   Joshua  Computer Science    male
2  Zachary  Computer Science    male
3   Nicole        Psychology  female

### How To remove duplicate by column value

In [71]:
student_list = [{'name' : 'Austin',
                 'major' : "Computer Science",
                 'sex': "male"},
                {'name' : 'Joshua',
                 'major' : "Computer Science",
                 'sex': "male"},
                {'name' : 'Zachary',
                 'major' : "Computer Science",
                 'sex': "male"},
                {'name' : 'Nicole',
                 'major' : "Psychology",
                 'sex': "female"},
                {'name' : 'Samantha',
                 'major' : "Economics",
                 'sex': "male"},
                {'name' : 'Joshua',
                 'major' : "None",
                 'sex': "male"},
                {'name' : 'Austin',
                 'major' : "Economics",
                 'sex': "male"}
                
]

df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

       name             major     sex
0    Austin  Computer Science    male
1    Joshua  Computer Science    male
2   Zachary  Computer Science    male
3    Nicole        Psychology  female
4  Samantha         Economics    male
5    Joshua              None    male
6    Austin         Economics    male

In [72]:
#열에 있는 값을 이용하여 중복된 값을 찾고 없앤다(ex. Name이 같을 때)
df.duplicated() #정확하게 겹치는 row가 없어서 모두 false로 나옴

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [73]:
#duplicated 에 인자를 넣어줌
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [74]:
df.drop_duplicates(['name'], keep = 'first') #앞의 Austin과 Joshua가 남음(default는 first)

       name             major     sex
0    Austin  Computer Science    male
1    Joshua  Computer Science    male
2   Zachary  Computer Science    male
3    Nicole        Psychology  female
4  Samantha         Economics    male

In [75]:
df.drop_duplicates(['name'],keep = 'last')

       name             major     sex
2   Zachary  Computer Science    male
3    Nicole        Psychology  female
4  Samantha         Economics    male
5    Joshua              None    male
6    Austin         Economics    male

## 10) NaN(None) 찾아서 다른 값으로 변경하기(fillna)

In [86]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                  {'name': 'Matthew', 'job': "teacher", 'age': 35},
                  {'name': 'Yuna', 'job': "teacher", 'age': 37},
                  {'name': 'Elijah', 'job': "student", 'age': 10},
                  {'name': 'Aiden', 'job': "student", 'age': 12},
                  {'name': 'Isabella', 'job': "student", 'age': 11},
                  {'name': 'Matthew', 'job': "teacher", 'age': None},
                  {'name': 'John', 'job': "student", 'age': None}
                  
                  ]
df = pd.DataFrame(school_id_list, columns=['name','job','age'])

In [87]:
df

       name      job   age
0      John  teacher  40.0
1   Matthew  teacher  35.0
2      Yuna  teacher  37.0
3    Elijah  student  10.0
4     Aiden  student  12.0
5  Isabella  student  11.0
6   Matthew  teacher   NaN
7      John  student   NaN

In [78]:
#pandas에서 none값 쉽게 확인
df.shape

(8, 3)

In [79]:
df.info() #age는 6개만 none이 아님

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [80]:
df.isna() #false와 true로 표시(None은 True로)

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [81]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [89]:
df.age = df.age.fillna(0) #df.age column에서 null 발견하면 0으로 바꿈

In [90]:
df

       name      job   age
0      John  teacher  40.0
1   Matthew  teacher  35.0
2      Yuna  teacher  37.0
3    Elijah  student  10.0
4     Aiden  student  12.0
5  Isabella  student  11.0
6   Matthew  teacher   0.0
7      John  student   0.0

In [91]:
#데이터분석 시 null 값 발견하면 그럴듯한 값으로 바꿔야 함. 이 때는 median(가운데값) 값으로 변경함.

school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                  {'name': 'Matthew', 'job': "teacher", 'age': 35},
                  {'name': 'Yuna', 'job': "teacher", 'age': 37},
                  {'name': 'Elijah', 'job': "student", 'age': 10},
                  {'name': 'Aiden', 'job': "student", 'age': 12},
                  {'name': 'Isabella', 'job': "student", 'age': 11},
                  {'name': 'Matthew', 'job': "teacher", 'age': None},
                  {'name': 'John', 'job': "student", 'age': None}
                  
                  ]
df = pd.DataFrame(school_id_list, columns=['name','job','age'])

In [92]:
df

       name      job   age
0      John  teacher  40.0
1   Matthew  teacher  35.0
2      Yuna  teacher  37.0
3    Elijah  student  10.0
4     Aiden  student  12.0
5  Isabella  student  11.0
6   Matthew  teacher   NaN
7      John  student   NaN

In [93]:
#age value 변경 (df를 'job'로 그룹지어서 이 중 'age' 값을 다룸.)

df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)

In [94]:
df

       name      job   age
0      John  teacher  40.0
1   Matthew  teacher  35.0
2      Yuna  teacher  37.0
3    Elijah  student  10.0
4     Aiden  student  12.0
5  Isabella  student  11.0
6   Matthew  teacher  37.0
7      John  student  11.0

## 11) apply 함수, 다양한 예제로 활용해보기 (Apply)

In [95]:
date_list =[{'yyyy-mm-dd': '2000-06-27'},
            {'yyyy-mm-dd': '2002-09-24'},
            {'yyyy-mm-dd': '2005-12-20'}
            ]
df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [96]:
#year라는 column을 생성
def extract_year(column):
  return column.split('-')[0]

In [97]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year) #for 문 쓰지 않고 모든 row에 적용
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [98]:
#Apply에서 parameter 받는 방법
def get_age(year, current_year):
  return current_year - int(year) #year 값이 string이므로

In [100]:
df['age'] = df['year'].apply(get_age, current_year=2020)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2005-12-20  2005   15

In [101]:
#Parameter를 여러 개 보낼 수 있을까요?
def get_introduce(age, prefix, suffix):
  return prefix + str(age) + suffix

In [103]:
df['introduce'] = df['age'].apply(get_introduce, prefix = "I am ", suffix = " years old.")
df

   yyyy-mm-dd  year  age           introduce
0  2000-06-27  2000   20  I am 20 years old.
1  2002-09-24  2002   18  I am 18 years old.
2  2005-12-20  2005   15  I am 15 years old.

In [104]:
def get_introduce_2(row):
  return "I was born in "+str(row.year)+" , and I am "+str(row.age)+" years old."

In [105]:
df.introduce = df.apply(get_introduce_2, axis = 1) #row에 있는 모든 column 활용

In [106]:
df

   yyyy-mm-dd  year  age                                    introduce
0  2000-06-27  2000   20  I was born in 2000 , and I am 20 years old.
1  2002-09-24  2002   18  I was born in 2002 , and I am 18 years old.
2  2005-12-20  2005   15  I was born in 2005 , and I am 15 years old.

## 12) map, applymap 함수, 다양한 예제로 활용해보기

In [107]:
date_list = [{'date': '2000-06-27'},
             {'date': '2002-09-24'},
             {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns=['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [108]:
def extract_year(date):
  return date.split("-")[0]

In [109]:
df['year'] = df['date'].map(extract_year)

In [110]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [111]:
job_list =[{'age': 20, 'job':'student'},
           {'age': 30, 'job':'developer'},
           {'age': 30, 'job':'teacher'},
           ]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [112]:
#text를 숫자로 바꿀 때
df.job = df.job.map({'student': 1, "developer":2, "teacher":3}) #함수 대신 dictionary
df

   age  job
0   20    1
1   30    2
2   30    3

In [113]:
#모든 column에 적용시키고 싶을 때 applymap
x_y = [{'x':5.5, 'y':-5.6, 'z':-1.1},
       {'x':-5.2, 'y':5.5, 'z':-2.2},
       {'x':-1.6, 'y':-4.5, 'z':-3.3}
       ]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [114]:
import numpy as np

In [115]:
df = df.applymap(np.around) #around-반올림
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

In [ ]:
# 모든 column에 적용시키고 싶을 때 - applymap 사용
# 하나의 column에 대해 column 값 변경은 map 사용

## 13) 컬럼 내 유니크한 값 뽑아내고 갯수 확인하기(unique, value_counts)

In [116]:
job_list = [{'name': 'John', 'job':"teacher"},
            {'name': 'Christoper', 'job':"teacher"},
            {'name': 'David', 'job':"teacher"},
            {'name': 'Connor', 'job':"student"},
            {'name': 'Jacob', 'job':"student"},
            {'name': 'Amanda', 'job':"developer"},
            {'name': 'Christoper', 'job':"teacher"},
            {'name': 'Stephen', 'job':"teacher"},
            {'name': 'Adam', 'job':"banker"},
            {'name': 'Benjamin', 'job':"lawyer"},
            {'name': 'Katie', 'job':"basketball player"},
            {'name': 'Laura', 'job':"teacher"},
            {'name': 'Freya', 'job':"student"}
            ]
df = pd.DataFrame(job_list, columns = ['name','job'])
df

          name                job
0         John            teacher
1   Christoper            teacher
2        David            teacher
3       Connor            student
4        Jacob            student
5       Amanda          developer
6   Christoper            teacher
7      Stephen            teacher
8         Adam             banker
9     Benjamin             lawyer
10       Katie  basketball player
11       Laura            teacher
12       Freya            student

In [117]:
#unique한 value만 뽑고 싶을 때
df.job.unique() #teacher 여러 개 있다 하더라도 하나씩만 나옴. 직업 란에 있는 모든 직업들 볼 수 있음

array(['teacher', 'student', 'developer', 'banker', 'lawyer',
       'basketball player'], dtype=object)

In [118]:
df.job.value_counts()

teacher              6
student              3
developer            1
banker               1
lawyer               1
basketball player    1
Name: job, dtype: int64

## 14) 두 개의 데이터프레임 합치기(concat, append)

In [120]:
l1 = [{'name': 'Craig', 'job': "teacher"},
      {'name': 'Callum', 'job': "student"},
      {'name': 'Liam', 'job': "developer"}]

l2 = [{'name': 'Gareth', 'job': "dentist"},
      {'name': 'Claire', 'job': "farmer"},
      {'name': 'Ryan', 'job': "designer"}]

l3 = [{'name': 'Craig', 'job': "teacher"},
      {'name': 'Callum', 'job': "student"},
      {'name': 'Heather', 'job': "developer"}
]

l4 = [{'age': 25, 'country':'U.S'},
      {'age': 30, 'country':'U.K'},
      {'age': 45, 'country':'Korea'}]

In [121]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name','job'])

In [122]:
df1

     name        job
0   Craig    teacher
1  Callum    student
2    Liam  developer

In [123]:
df2

     name       job
0  Gareth   dentist
1  Claire    farmer
2    Ryan  designer

In [125]:
#두 개의 dataFrame을 Row로 합침(1)
result = pd.concat([df1,df2] ,ignore_index =  True) #각자의 인덱스 무시하고 줄세우기
result

     name        job
0   Craig    teacher
1  Callum    student
2    Liam  developer
3  Gareth    dentist
4  Claire     farmer
5    Ryan   designer

In [126]:
#두 개의 dataFrame을 Row로 합침(2)
result = df1.append(df2, ignore_index = True)
result

     name        job
0   Craig    teacher
1  Callum    student
2    Liam  developer
3  Gareth    dentist
4  Claire     farmer
5    Ryan   designer

In [127]:
#두 개의 dataFrame을 Column로 합침
df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age','country'])

In [128]:
df1

      name        job
0    Craig    teacher
1   Callum    student
2  Heather  developer

In [129]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [130]:
result = pd.concat([df1,df2], axis = 1, ignore_index = True)
result

         0          1   2      3
0    Craig    teacher  25    U.S
1   Callum    student  30    U.K
2  Heather  developer  45  Korea

In [131]:
#리스트 합치기 ( 실제값, 예측값)
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [132]:
comparison  = pd.DataFrame({'label':label, 'prediction': prediction})

In [133]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4